# Examples Walkthrough
![Oracle 23c](images/OracleDatabase23c.png)

This release has set its sights on empowering developers and simplifying the use of Artificial Intelligence (AI) in the database. Along with a host of other improvements in a database renowned for its unparalleled support for high availability, top-notch performance, and ironclad security. More importantly, this new release also enhances Oracle Databases credentials as the leading converged database supporting JSON, XML, Graph, Spatial, Text and Relational. And doing this for any type of workload whilst allowing developers to do this in a development style that suits them.

The following are a series of SQL and Python examples to show some of the new features in Oracle Database 23c. They will be updated over time.

The cell simply loads any needed libraries for the notebook to work. It's mandatory and has nothing to do with Oracle Database 23c.

In [ ]:
import oracledb
from pyvis.network import Network
from prettytable import PrettyTable
from IPython.display import HTML, display
import pandas as pd
import json
from HelperFunctions import execute_plsql_and_dbmsoutput, execute_plsql, render_graph, render_query, compare_performance

%reload_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False
pd.set_option('display.max_colwidth', None)

pd.set_option('display.max_colwidth', None)

# The following is just a helper function to get the curren connection
def get_notebook_oracle_connection() -> object:
    # Ask ipython-sql for the current connection and assuming we want the first one
    connections = %sql l / --connections
    alchemy_connection = connections[next(iter(connections))]
    return alchemy_connection.internal_connection.connection.dbapi_connection

#### Connect to the database
Change the connect string below to connect to your target database. The tests below are based on the Sales Order Entry schema from swingbench. In the connection string below you need to update the connection string in the form
```//<username>:<password>@192.168.86.235/?service_name=<service>```

In [ ]:
%sql oracle+oracledb://ora23c:ora23c@192.168.86.235/?service_name=soe

## Improvements to SQL
![Oracle 23c](images/SQLDatabase.png)

The following section shows some of the simple changes that have been made to SQL to make it easier to use SQL for developer

### Removed requirement for "dual"
In Oracle Database 23c there's no longer a requirement to include the ```from dual``` in select statements. This can simplify code and add compatibility to other database offerings. You can of course still continue to use ```from dual``` without any negative impact

In [ ]:
%%sql
-- Syntax prior to Oracle Database 23c
select systimestamp from dual

In [ ]:
%%sql
-- Syntax in Oracle Database 23c
select systimestamp

A common question is does the removal of ```from dual``` make any difference to execution performance? The answer is no. The following cell compares the performance of the execution of two statements to show the delta between them.

In [ ]:
compare_performance([{"Name" :"With From Dual", "SQL" : "select sysdate from dual"},
                     {"Name" :"Without From Dual", "SQL" : "select sysdate"}],
                     execution_count = 1000,
                     connection = get_notebook_oracle_connection())

### New Boolean Datatype
Oracle Database 23c adds a new Boolean datatype that can enrich application data models. It supports the ANSI SQL specification and supports all of the existing column capabilites (Not null, check default etc). New function ```to_boolean()``` conversion in to the boolean datatype

#### If exists for DDL
You can now check if a table exists (or doesn't) before creating or dropping it. This results in fewer errors in your scripts. Particularly useful for CI/CD

In [ ]:
%%sql
drop table if exists new_orders

We can now create a table table using the boolean datatype

In [ ]:
%%sql
create table if not exists new_orders
(id number generated by default on null as identity,
product_id number,
order_date timestamp,
customer_id number,
total_value number(6,2),
order_shipped boolean,
warranty interval year to month)

#### New Table Value Clause
You can now specify multiple rows with the ```VALUES``` clause making it much simpler to insert sample or reference data with insert, select or merge statements.

In [ ]:
%%sql
-- Insert multiple rows in a single DML operation
insert into new_orders (product_id, order_date, customer_id, total_value, order_shipped, warranty)
values
(12, systimestamp, 100001, 10.23, true, interval '2-0' year to month),
(234, systimestamp, 223223, 1200.00, false, interval '1-6' year to month),
(57, systimestamp, 238121, 110.1, True, interval '5-0' year to month),
(2, systimestamp, 78993, 20.50, null, interval '0-6' year to month)

We can also use the boolean a simple filter. In this case select just the orders that have shipped

In [ ]:
%%sql
-- boolean can be used as a filter
select id,
product_id ,
order_date ,
customer_id,
total_value,
order_shipped
from new_orders
where not order_shipped

the ```to_boolean``` makes it simple to numbers and strings into boolean values

In [ ]:
%%sql
select to_boolean(1)
union all
select to_boolean('FALSE')
union all
select to_boolean('T')
union all
select to_boolean(0)

### SQL Domains
![Oracle 23c](images/domains.png)

Whilst database columns allow you to specify the data that will be held within them (varchar, dates, numbers, booleans etc.), these base types don't really describe what these types mean and their place in your enterprise data. SQL Domains allow you to specify higher-level datatypes for your data and as a result, provide consistent metadata for development/analytics/ETL tools. So instead of trying to indicate that a column holds a credit card number by the name you give it, you can explicitly define the domain and assign it to the column. You can also assign constraints to a domain ensuring that data is consistent across tables. In fact, you can also define how a domain should be rendered.

First, we'll drop the table if it exists.

In [ ]:
%%sql
drop table if exists new_customers purge

We can now create domains just by specifying their data type and use them primarily as additional metadata

In [ ]:
%%sql
create domain if not exists date_of_birth as date

In [ ]:
%%sql
create domain if not exists address as varchar2(100)

We can also use domains across multiple columns and specify how the data is to be displayed

In [ ]:
%%sql
create domain if not exists persons_name as (first_name as varchar2(100),
                               last_name as varchar2(100))
                               display initcap(first_name) || ' ' || (initcap(last_name))

We can also apply constraints to the domains to ensure data consistency

In [ ]:
%%sql
create domain if not exists email AS varchar2(30)  
    constraint email_c check (regexp_like (email, '^(\S+)\@(\S+)\.(\S+)$'))

In [ ]:
%%sql
create domain if not exists us_postal_code as varchar2(10)
    constraint zip_code_c check (regexp_like(us_postal_code, '^\d{{5}}(?-\d{{4}})?$'))

**NOTE** the two curly brackets in the example above are only used as an escape sequence for Jupyter notebook. Normally only one is needed.

Oracle 23c also provides predefined domains for you to use with many more on the way.

In [ ]:
%%sql
select LISTAGG(name, ',') as "System provided domains" from all_domains where owner = 'SYS'

We can now use the domains we've created to create a customers table leveraging the domains we've just created.

In [ ]:
%%sql
create table if not exists new_customers (
    id             number generated by default on null as identity,
    first_name     varchar2(100),
    last_name      varchar2(100),
    dob            date_of_birth,         -- User Defined Domain
    email          email,                 -- User Defined Domain
    address        address,               -- User Defined Domain
    zip            us_postal_code,        -- User Defined Domain
    phone_number   phone_number_d,        -- System Provided Domain
    credit_card    credit_card_number_d,  -- System Provided Domain
    joined_date    timestamp default systimestamp,
    gold_customer  boolean default false,
    domain persons_name(first_name, last_name))

The following insert should fail because it has an incorrect zip code ```12345:123``` instead of something like ```12345-1234```.

In [ ]:
%%sql
insert into new_customers (id, first_name, last_name, email, address, zip)
values
(100001, 'Dom', 'Giles', 'dg7889@gmail.com', '10 smith street', '12345:123')

As with the previous failed insert, this one will fail too as it does not include a valid email, ```mrichards```.

In [ ]:
%%sql
insert into new_customers (id, first_name, last_name, email, address, zip)
values
(100001, 'Martha', 'Richards', 'mrichards', '11 smith street', '64783')

But inserting valid values into the table works as expected.

In [ ]:
%%sql
insert into new_customers (id, first_name, last_name, email, address, zip)
values
(100001, 'Dom', 'Giles', 'dg7889@gmail.com', '10 smith street', '34454-1667'),
(223223, 'John', 'Smith', 'jsmith@hotmail.com', 'the grove', '28902'),
(238121, 'janet', 'white', 'jw123@gmail.com', 'apartment 256, 120 east street', '18092-7980'),
(78993, 'SUE', 'GRAY', 'sue_gray@gmail.com', '2345 main street', '34454')

We can use also ```domain_display``` to render the selected columns in a consitent fashion.

In [ ]:
%%sql
select domain_display(first_name, last_name) as customer_name from new_customers

Two user views, ```USER_DOMAINS``` and ```USER_DOMAIN_CONSTRAINTS``` allow us to query the defintions of our domains.

In [ ]:
%%sql
select * from USER_DOMAINS

In [ ]:
%%sql
select * from USER_DOMAIN_CONSTRAINTS

### Annotations
![Oracle 23c](images/annotation.png)

Annotations allow us to specify additional metadata for tables, columns, indexes, views, materialised views and even domains. Whilst we've been able to use comments to provide descriptions for objects, Annotations allow us to be much more expressive in the type and detail of the information stored. Annotations do this by allowing us to create name pairs for our objects. The name pairs can be of any type we think is relevant. For example,  we can add an annotation that classifies a column as PII (Personal Identifiable Data), the group of data it belongs to and the UI label associated with it in forms or reports.

Let's first add an annotation to an email column with some of the attributes we described above.

In [ ]:
%%sql
alter table new_customers modify (email annotations (PID 'true'))

In [ ]:
%%sql
alter table new_customers modify (email annotations (data_classification 'confidential'))

In [ ]:
%%sql
alter table new_customers modify (email annotations (ui_display_label 'Email'))

In [ ]:
%%sql
drop table if exists new_customers

In [ ]:
%%sql
create table if not exists new_customers (
    id             number generated by default on null as identity      annotations (data_classification 'restricted', ui_display_label 'Customer ID', classification 'Identifier'),
    first_name     varchar2(100)                                        annotations (data_classification 'confidential', ui_display_label 'First Name', PID, classification 'Naming'),
    last_name      varchar2(100)                                        annotations (data_classification 'confidential', ui_display_label 'Last Name', PID, classification 'Naming'),
    dob            date_of_birth                                        annotations (data_classification 'confidential', ui_display_label 'Date of Birth', PID, classification 'Birth Date'),
    email          email                                                annotations (data_classification 'confidential', ui_display_label 'Email', PID, classification 'Email'),
    address        address                                              annotations (data_classification 'confidential', ui_display_label 'Address', PID, classification 'Location'),
    zip            us_postal_code                                       annotations (data_classification 'confidential', ui_display_label 'Zip Code', PID, classification 'Location'),
    phone_number   phone_number_d                                       annotations (data_classification 'confidential', ui_display_label 'Phone Number', PID, classification 'Phone'),
    credit_card    credit_card_number_d                                 annotations (data_classification 'confidential', ui_display_label 'Credit Card Number', PID, classification 'Credit Card'),
    joined_date    timestamp default systimestamp                       annotations (data_classification 'restricted', ui_display_label 'Joining Date', classification 'Application Date'),
    gold_customer  boolean default false                                annotations (data_classification 'public', ui_display_label 'Gold Member', classification 'Application Info')
    domain persons_name(first_name, last_name))

Creating or adding annotations to the table above makes it very simple for us to find Personal Identifiable Data (PID) using a simple SQL statement. We do this by querying one of the user views ```USER_ANNOTATIONS_USAGE```.

In [ ]:
%%sql
select * from USER_ANNOTATIONS_USAGE where annotation_name = 'PID'

And repopulate the table for any future use cases

In [ ]:
%%sql
insert into new_customers (id, first_name, last_name, email, address, zip)
values
(100001, 'Dom', 'Giles', 'dg7889@gmail.com', '10 smith street', '34454-1667'),
(223223, 'John', 'Smith', 'jsmith@hotmail.com', 'the grove', '28902'),
(238121, 'janet', 'white', 'jw123@gmail.com', 'apartment 256, 120 east street', '18092-7980'),
(78993, 'SUE', 'GRAY', 'sue_gray@gmail.com', '2345 main street', '34454')

### Direct joins for updates and deletes
Prior to Oracle Database 23c updates that need information from other tables required the use of subqueries which could make the SQL more complex and difficult to maintain. Now the syntax is much simpler and the join can be performed in the same update statement.

Our update statement will make selected customers "gold" if they've made orders greater than 1000. Previously to do this we'd need have crafted a sub query. The new functionality makes this type of operation more intuitive.

In [ ]:
%%sql
update new_customers c
set c.gold_customer = true
from new_orders o
where o.customer_id = c.id
and o.total_value > 1000

And querying the database we can now see that "John Smith" has "True" for gold_customer

In [ ]:
%%sql
select c.id, c.first_name, c.last_name, c.email, c.address, c.zip, c.gold_customer, sum(o.total_value) as "Total Orders Value"
from new_customers c, new_orders o
where o.customer_id = c.id
group by c.id, c.first_name, c.last_name, c.email, c.address, c.zip, c.gold_customer

### Aggregations over interval Data Types
In Oracle Database 23c it's much simpler to aggregate intervals without the need to cast to other datatypes and extract values.

**NOTE:** I'm only having to cast the result in this instance since Jupyter doesn't support the rendering of the interval datatype

In [ ]:
%%sql
-- New in Oracle 23c

select TO_CHAR(avg(warranty)) as "Average Product Warranty"
from new_orders

The result above shows that the average warranty was 2 years and 3 months.

The simpled syntax above is in stark comparison to the difficult to manage syntax found prior to Oracle Database 23c

In [ ]:
%%sql
-- Prior to Oracle 23c

select to_char(NUMTOYMINTERVAL(AVG((EXTRACT(YEAR FROM warranty)*12) + (EXTRACT(MONTH FROM warranty))), 'month')) as "Average Product Warranty"
from new_orders

### Update can now return new and old values
In Oracle Database 23c there's new flexibility in the update statement allowing you return both the orginal value and the value after the update took place. In the code below we use a bulk update against the orders table that returns both the original value of the order and the value after a 5% uplift has been placed on it. Just for clarity we are outputting the result via dbms_output.

In [ ]:
connection = get_notebook_oracle_connection()
execute_plsql_and_dbmsoutput(connection,
        '''begin
            declare
                type old_values_t is table of new_orders.total_value%type;
                type new_values_t is table of new_orders.total_value%type;
                old_values old_values_t;
                new_values new_values_t;
                -- We can now return both the old and new values from an update statement
                begin
                    update new_orders
                    set TOTAL_VALUE = TOTAL_VALUE*1.05
                    returning old total_value, new total_value
                    bulk collect into old_values, new_values;

                    --  The following outputs the new and old values to DBMS_OUTPUT
                    dbms_output.put_line('Old Values, New Values');
                    for i in old_values.first .. old_values.last loop
                        dbms_output.put_line(old_values(i) || ', ' ||new_values(i));
                    end loop;
                end;
            end;''')

### JavaScript Stored Procedures
![Oracle 23c](images/js.png)

You can now use Javascript and it's many libraries as a first class citizen in the database. This allows you to leverage the large pool of resources for this porpular language directly in the database.

Before you start you'll need to make sure that you've granted the right priveleges to your user i.e.

```
grant db_developer_role to soe;
grant create mle to soe;
grant execute on javascript to soe;
```

First we create the a mle_module of language javascript and export it.

In [ ]:
connection = get_notebook_oracle_connection()
execute_plsql(connection,
        '''
        create or replace mle module hello_module
        language javascript as

        function hello(name) {
            console.log(`Hello, ${name}`);
        }

        export { hello }
        ''')

Then we create a stored procedure that uses the javascript module

In [ ]:
execute_plsql(connection,
        '''
        create or replace procedure hello_proc (p_name varchar2)
        as mle module hello_module
        signature 'hello(string)';
        ''')

And then we can simply call it. ```console.log()``` in the database writes to DBMS_OUTPUT.

In [ ]:
execute_plsql_and_dbmsoutput(connection,
'''
        begin
            hello_proc('From TechLounge');
        end;
''')

### Group by Alias
The use of group by has been simplified in Oracle Database 23c allowing you to reference a complex aggregation/calculation by using just it's alias or reference. This can be used with group bys (including cube, rollup and grouping sets). It can also be used with having clauses and select clauses.

In [ ]:
%%sql
select sum(o.total_value) as "Total Orders Value",
       c.id,
       c.first_name,
       c.last_name
from new_orders o,
     new_customers c
where o.customer_id = c.id
group by c.id, c.first_name, c.last_name
having "Total Orders Value" < 100

In [ ]:
execute_plsql(connection,'''
alter session set GROUP_BY_POSITION_ENABLED=TRUE
''')

In [ ]:
%%sql
select sum(o.total_value) as "Total Orders Value",
       c.id,
       c.first_name,
       c.last_name
from new_orders o,
     new_customers c
where o.customer_id = c.id
group by 2, 3, 4
having "Total Orders Value" < 100

## Property Graph and PG/SQL support
![Oracle 23c](images/graph.png)

Oracle Database 23c is the first commercial database to add support for the SQL/PGQ standard. This change adds in-database support for Graph models directly into the database. Graphs edges and nodes can now be modeled on new or existing datasets and queried with the SQL/PGQ extensions that make it simpler to navigate complex relations. And you can build your Graphs using relational or JSON Document datatypes... or a mix of both.

In this section we'll place a grph model on top of the two table we created earlier and query them with SQL/PGQ

Lets add a few more customers to start with

In [ ]:
%%sql
insert into new_customers (id, first_name, last_name, email, address)
values
(43242, 'Katie', 'Giles', 'kgiles@gmail.com', '10 john hope road'),
(75567, 'Elizabeth', 'Green', 'egreen777@hotmail.com', '2 main street'),
(215456, 'Susan', 'Giles', 'susan.giles@gmail.com', '122 arthur road'),
(96743, 'Mark', 'Blue', 'mblue55@hotmail.com', 'orchard house, home road'),
(47943, 'Robert', 'Yellow', 'robyel888@gmail.com', 'appartment 12, 120 west street'),
(132, 'Alan', 'Red', 'ared@hotmail.com', '67 east street'),
(89324, 'Ashish', 'Gray', 'ar2637@gmail.com', '23 alex Road'),
(14576, 'Max', 'White', 'max.white@hotmail.com', '24 alex Road'),
(93034, 'Nick', 'Red', 'nred@gmail.com', '34 north avenue'),

To model the relationships between the customer we can create a simple table to define what those relationships look like. This isn't uncommon in some online stores where they offer shared billing or discounts to friends and family. Indeed this table or something similar to it may already exists in your schema.

In [ ]:
%%sql
drop table if exists customer_relationships

In [ ]:
%%sql
create table if not exists customer_relationships(
    id number GENERATED ALWAYS as IDENTITY(START with 1 INCREMENT by 1) not null constraint rel_pk primary key,
    source_id number,
    target_id number,
    relationship varchar2(100))

And then define the relationship between the customers using a simple insert using the new multi value insert functionality

In [ ]:
%%sql
insert into customer_relationships (source_id, target_id, relationship)
values
    (238121, 78993, 'friend'),
    (100001, 223223, 'work colleague'),
    (78993, 223223, 'friend'),
    (100001, 238121, 'work colleague'),
    (223223, 14576, 'cousin'),
    (78993, 100001, 'mother'),
    (100001, 43242, 'spouse'),
    (43242, 75567, 'friend'),
    (215456, 43242, 'daughter'),
    (215456, 100001, 'daughter'),
    (215456, 96743, 'friend'),
    (215456, 14576, 'friend'),
    (14576, 215456, 'friend'),
    (132, 93034, 'brother'),
    (14576, 100001, 'friend'),
    (100001, 14576, 'friend'),
    (47943, 43242, 'friend'),
    (47943, 238121, 'friend'),
    (238121, 47943, 'friend'),
    (132, 43242, 'friend'),
    (132, 75567, 'friend'),
    (100001, 89324, 'friend'),
    (89324, 43242, 'friend'),
    (75567, 132, 'friend')

The next step is at the heart of this new functionality. Here we define a property graph defining it vertices and edges based on our exising table (the vertices) and the relationships (edges) that we defined in the previous step.

In [ ]:
%%sql
drop property graph customers_graph

In [ ]:
%%sql
create property graph customers_graph
   vertex tables (
       new_customers
       key(id)
       label customer
       properties (id, first_name, last_name)
   )
   edge tables (
       customer_relationships as related
       key (id)
       source key(source_id) references new_customers(id)
       destination key(target_id) references new_customers(id)
       properties (id, relationship)
   )

In [ ]:
net = Network(notebook=True, cdn_resources='in_line', directed=True)
connection = get_notebook_oracle_connection()
render_graph(net, connection)
net.show('html/customers.html')

We can now query this graph using the new SQL/PGQ extension in Oracke Database 23c. The following query looks for customers, start at the vertice 'Dom Giles' and then his friends (directional) within 1 to 3 hops. The important step here is the ```match``` clause which allows us to define the nodes we are looking for in our graph. We telling we are start from ```V1```. Which we then apply a filter to, to slect ```Dom Giles```. We tell it to traverse the graph in a single direction with ```->``` navigating all edges that are marked ```friends``` from 1 to 3 hops. We finally tell it the query to return the paths for the hops that match the query.

In [ ]:
net = Network(notebook=True, cdn_resources='in_line', directed=True)
render_query(net, connection, '''
select distinct
fnames,
inames
from graph_table(customers_graph
               match
               (v1 is customer) ( -[e is related where e.relationship = 'friend']-> (v2 is customer where v2.first_name != 'Dom')) {1,3}
               where v1.first_name = 'Dom' and v1.last_name = 'Giles'
               columns (LISTAGG(v2.first_name ||' '|| v2.last_name, ', ') as fnames,
                        LISTAGG(v2.id, ', ') as inames,
                       v1.first_name ||' '|| v1.last_name as source)
    )''', highlight=[100001])
net.show('html/friendsoffriendsquery.html')

## New JSON Features

In Oracle Database 23c, JSON capabilities go beyond what our competition provides. Over the last few years we've listened to our customers and the issues they face in managing JSON data in a complex enterprise environment. The improvements we've made in Oracle Database 19c, 21c and now 23c will enable customers to not only benefit from the flexibility that building applications with JSON offers but also all of the benefits the relational model can provide for data management and analytics. And more importantly, allows users to continue to benefit from all of Oracle's availability, security and performance features.

### JSON Relation Duality Views
![Oracle 23c](images/duality.png)

In Oracle Database 23c we're introducing a new technology called JSON Relational Duality. It provides developers with the strengths of both the relational and JSON Document models. Developers can build applications using either approach with a single source of truth. It removes many of the problems associated with Object Relational Mapping and solves the problems found with locking and securing complex JSON objects. 

In the following example we'll provide JSON Relation Duality ontop of the tables ```NEW_CUSTOMERS``` and ```NEW_ORDERS```

One of the first things we should do is ensure that we've got primary keys and foreign keys on our tables.

In [ ]:
%%sql
alter table new_customers add (constraint new_customers_pk primary key (id))

In [ ]:
%%sql
alter table new_orders add (constraint new_orders_pk primary key (id))

In [ ]:
%%sql
alter table new_orders add (constraint new_orders_fk FOREIGN KEY (customer_id) REFERENCES new_customers (id))

We can now create our materialised ```CUSTOMERS_DV```. The thing to note is that it follows the structure of the document we are looking to create. Anyone who's familiar with GraphQL shouldn't have any problems getting to grips with the syntax. Alternatively, you can define them using a "select" statement like syntax.

In [ ]:
%%sql
CREATE or REPLACE JSON RELATIONAL DUALITY VIEW customers_dv AS
    new_customers @insert @update @delete
    {CustomerID      : id
     FirstName       : first_name
     LastName        : last_name
     DateOfBirth     : dob
     Email           : email
     Address         : address
     Zip             : zip
     orders : new_orders @insert @update @delete
       [ {OrderID             : id
          ProductID           : product_id
          OrderDate           : order_date
          TotalValue          : total_value
          OrderShipped        : order_shipped
          } ]
    }

Using SQL we can update the JSON document using the json_transform operation to add new orders to the customers object.

In [ ]:
%%sql
update customers_dv c
set c.data = json_transform(
            data,
            APPEND '$.orders' =  JSON {'ProductID' : 25, 'OrderDate' : systimestamp, 'TotalValue' : 206} )
where c.data.CustomerID = 100001

We can also use SQL select statements and dot notation to query data in the duality view.

In [ ]:
%%sql result <<
select *
from customers_dv c
where c.data.CustomerID = 100001

I'm using Python here to simply to format the result of the change.

In [ ]:
print(json.dumps(result['data'][0], indent=4, sort_keys=True, default=str))

Or we can use a simple relational insert against the orders table

In [ ]:
%%sql
insert into new_orders (customer_id, product_id, order_date, total_value) values (100001, 3232, systimestamp, 23)

We can also use Oracle's SODA (Simple Object Data API) or even the Mongo API to work against the Duality View.

First we need to enable the newly create duality view. We can either do this via tools like SQLDeveloper, DBActions and SQLCL. Or we can do this via PL/SQL call as in this example.

In [ ]:
connection = get_notebook_oracle_connection()
execute_plsql(connection,
              '''BEGIN
                    ORDS.ENABLE_OBJECT(
                            p_object => 'CUSTOMERS_DV',
                            p_object_type => 'VIEW'
                        );
                 END;''')
connection.commit()

 Here I'm issuing REST calls against the database. To start with I issue a simple REST ```GET``` operation. In this instance we are proving a Query By Example (QBE) to search for a document.

In [ ]:
# Python example of querying a document using a REST get operation, with Query by Example.
import requests

headers = {'Accept': 'application/json'}

r = requests.get(
    'http://localhost:8080/ords/ora23c/customers_dv/',
    params={"q" : """{"FirstName" : { "$eq" : "Dom" } }"""},
    headers=headers)

# Just print out the response from ORDS
print( json.dumps(r.json(), indent=4, sort_keys=True, default=str))

In this example we are using the REST ```POST``` command to add a new customer with an order. So even though we are posting a single document, it results in two new rows being placed in the ```CUSTOMERS``` and the ```ORDERS``` table. We don't need to provide IDs for either the customer or the order since these are automatically generated and returned in the response.

In [ ]:
# Python example of adding a new customer and their order using a REST POST operation.
import requests

r = requests.post('http://localhost:8080/ords/ora23c/customers_dv/',
    json={
        "FirstName": "Max",
        "LastName": "Giles",
        "Email": "mgil333@gmail.com",
        "Address": "10 smith street",
        "Zip": "72722-1667",
        "orders" : [
            {"ProductID" : 21,
            "TotalValue" : 54}
        ]
    })
# Print the respose from ORDS. A code of 201 means the JSON document was successfully inserted into the database
print(f"Status Code: {r.status_code}, Response: {json.dumps(r.json(), indent=4, sort_keys=True, default=str)}")

The REST call will ```POST``` a document to the database. The Duality view will persist the data to the two tables that make up the ```CUSTOMERS_DV```. We can select those rows from each of the underlying tables.

In [ ]:
%%sql 
select *
from new_customers c
where c.ID = 1

In [ ]:
%%sql
select o.id, o.order_date, o.order_shipped, o.product_id, o.total_value
from new_orders o
where o.ID = 7

### JSON Schemas

![Oracle 23c](images/jsonschema.png)

Support for JSON was introduced in Oracle Database 12c and has been a very popular feature. It provides developers with a flexible approach to the eveolution of the objects they are using to persist their data. However sometimes there's a case to be made for a more rigid approach to the way data is stored. In these instances Oracle Database 23c introduces support for JSON Schemas.

Lets first create a JSON object that holds customers as JSON documents rather than as a relational structure. We ask Oracle to validate the JSON documents it holds via a constraint

First drop the table if it already exists

In [ ]:
%%sql
drop table if exists customers_j

Now create the table using JSON schema validation. You can findout more on JSON schemas [here](https://json-schema.org/learn/)

In [ ]:
%%sql
create table if not exists customers_j (
    data JSON constraint customers_schema check (
    data is JSON VALIDATE USING '{"type" : "object",
                                 "properties" : {
                                    "id" : {"type" : "number"},
                                    "FirstName" : {"type" : "string"},
                                    "LastName" : {"type" : "string"},
                                    "Email" : {"type" : "string"},
                                    "Address" : {"type" : "string"},
                                    "JoinDate" : {"type" : "string"},
                                    "GoldCustomer" : {"type" : "boolean"}
                                    }, "required" : ["id", "FirstName", "LastName"]
                                 }
                                 '
    )
)

The first row we insert has no issues as it's a properly formed JSON document and conforms to the specified schema for this table/collection.

In [ ]:
%%sql
insert into customers_j values ('{"id": 1,
                                "FirstName" : "Scott",
                                "LastName" : "Tiger",
                                "email" : "scott.tiger@gmail.com",
                                "Address" : "42 Dolphin Drive",
                                "JoinDate" : "12-Dec-2000",
                                "GoldCustomer" : true
                                }
')

This document insert fails because we've used "10" as the last name. It's the wrong data type

In [ ]:
%%sql
insert into customers_j values ('{"id": 1,
                                "FirstName" : "Scott",
                                "LastName" : 10,
                                "email" : "scott.tiger@gmail.com",
                                "Address" : "42 Dolphin Drive",
                                "JoinDate" : "12-Dec-2000",
                                "GoldCustomer" : true
                                }
')

This document insert fails because we didn't provide a "LastName" attribute.

In [ ]:
%%sql
insert into customers_j values ('{"id": 1,
                                "FirstName" : "Scott",
                                }
')

And if we select the data in the table we can see that we only have one valid document.

In [ ]:
%%sql
select c.data from customers_j c